
[
  {
    "slug": "hybrid-funnel",
    "title": "Replace a leaky funnel with a system that pays for itself",
    "type": "Hybrid",
    "context": "Mid-market services brand; leads rose, conversions collapsed.",
    "creative": "Rewrote positioning from features to outcomes, simplified the lead capture form.",
    "technical": "Rebuilt key pages in React SSG, implemented server-side GA4 events, automated lead routing to sales.",
    "results": [ "CPL down 37% in 60 days", "Close rate up 14% → 24%", "Time to first contact 22h → 2h" ],
    "receipts": ["GA4 export", "CRM report", "commit log", "changelog"]
  },
  {
    "slug": "clarity-activation",
    "title": "Stop shouting. Say one true thing and say it everywhere.",
    "type": "Creative",
    "context": "SaaS product with scattered messaging.",
    "creative": "Unified brand story into a single promise, simplified site to three core pages, rewrote onboarding emails to match site promise.",
    "technical": "Stripped legacy CSS, implemented a consistent type scale, added simple in-app tour events.",
    "results": [ "Activation +31%", "Trial-to-paid +9 pts", "Tickets -18%" ],
    "receipts": ["Email diff", "onboarding flow", "dated dashboards"]
  },
  {
    "slug": "static-fast-reliable",
    "title": "Static, fast, reliable.",
    "type": "Technical",
    "context": "Slow content site, broken analytics.",
    "creative": "Designed a cleaner, more readable article template.",
    "technical": "Migrated from monolithic CMS to React SSG, optimized images with modern formats, implemented a simple GA4->Sheets ETL pipeline.",
    "results": [ "TTFB -62%", "CLS <0.05", "Reporting time 6h → 30m" ],
    "receipts": ["Lighthouse reports", "uptime logs", "GA exports"]
  },
  {
    "slug": "failure-with-fix",
    "title": "We shipped a change that hurt. We owned it and recovered.",
    "type": "Hybrid",
    "context": "SEO migration missed redirect parity, causing a temporary traffic dip.",
    "creative": "Wrote a public, transparent post-mortem explaining the issue and the fix.",
    "technical": "Built a parity checklist script, added preflight redirect QA to CI/CD, implemented synthetic monitoring for critical paths.",
    "results": [ "Organic −18% for 6 days", "Recovered with net +4% in 3 weeks" ],
    "receipts": ["Timeline", "redirect map", "postmortem notes"]
  },
  {
    "slug": "b2b-content-engine",
    "title": "Build a content engine that creates customers",
    "type": "Creative",
    "context": "B2B tech company with a blog that got traffic but no leads.",
    "creative": "Developed 3 core content pillars tied to product value, created templates for case studies and guides, embedded CTAs.",
    "technical": "Built a resource hub with filtering, added schema markup for rich snippets.",
    "results": [ "Content-sourced leads +200% QoQ", "Time on page for key articles +90s" ],
    "receipts": ["GA4 content group report", "CRM attribution report"]
  },
  {
    "slug": "abandon-cart-flow",
    "title": "Recover 15% of abandoned carts with better emails",
    "type": "Creative",
    "context": "E-commerce store with a generic, single-step cart abandonment flow.",
    "creative": "Wrote a 3-step email sequence: reminder with social proof, objection handling (shipping, returns), and a final small incentive.",
    "technical": "Segmented flow based on cart value, A/B tested subject lines using email provider's API.",
    "results": [ "Cart recovery rate from 4% to 15%", "$25k recovered revenue in first month" ],
    "receipts": ["Email platform analytics", "Shopify sales report"]
  },
  {
    "slug": "dev-ops-pipeline",
    "title": "CI/CD pipeline for a marketing site",
    "type": "Technical",
    "context": "Marketing team relied on manual FTP uploads, causing errors and slow deploys.",
    "creative": "Trained marketing team on using git for content changes.",
    "technical": "Set up a GitHub Actions pipeline to build the Vite site, run visual regression tests with Percy, and deploy to Netlify.",
    "results": [ "Deploy time from >1 hour to <5 minutes", "Production errors from manual uploads eliminated" ],
    "receipts": ["GitHub Actions logs", "Percy.io dashboard"]
  },
  {
    "slug": "data-studio-dashboard",
    "title": "From 10 spreadsheets to one dashboard",
    "type": "Technical",
    "context": "Management team spent a day a week consolidating reports.",
    "creative": "Designed a one-page dashboard focusing on 5 key metrics.",
    "technical": "Connected GA4, Google Ads, and CRM data to BigQuery, wrote SQL views to join and clean data, visualized in Looker Studio.",
    "results": [ "Manual reporting time reduced by 95%", "Shared view of truth across teams" ],
    "receipts": ["Looker Studio dashboard", "SQL view definitions"]
  },
  {
    "slug": "saas-pricing-page",
    "title": "Pricing page redesign lifts demo requests by 40%",
    "type": "Hybrid",
    "context": "SaaS company's pricing was confusing and scared users away.",
    "creative": "Redesigned page around value metrics instead of feature lists, added a clear FAQ section, included social proof.",
    "technical": "A/B tested the new design against the old one using a feature flag system.",
    "results": [ "Demo requests from pricing page +40%", "Fewer pricing-related support questions" ],
    "receipts": ["A/B test report", "Hotjar recordings"]
  },
  {
    "slug": "meta-ads-healthcare",
    "title": "Healthcare client: $28k revenue from $3.2k ad spend",
    "type": "Hybrid",
    "context": "Local healthcare provider needed new patient acquisition at scale.",
    "creative": "Developed patient testimonial video ads, wrote benefit-focused copy addressing common pain points, designed landing pages for each service line.",
    "technical": "Set up Meta Pixel with server-side conversion tracking, built custom audiences from CRM data, implemented automated lead scoring via Zapier.",
    "results": [ "$28,417 in revenue from $3,247 ad spend", "ROAS 8.7x", "89 qualified leads, 23 became patients" ],
    "receipts": ["Meta Ads Manager screenshots", "CRM conversion report"]
  },
  {
    "slug": "email-reactivation",
    "title": "Win back 18% of dormant subscribers with targeted campaign",
    "type": "Creative",
    "context": "SaaS company had 12k inactive subscribers who hadn't opened an email in 6+ months.",
    "creative": "Created a 4-email reactivation series: feedback request, value reminder, product updates, final farewell with unsubscribe prompt.",
    "technical": "Segmented list by last engagement date and account status, set up automated workflow in HubSpot, tracked re-engagement metrics.",
    "results": [ "18% reactivation rate (2,160 subscribers)", "342 trial signups from reactivated list", "List health improved with unengaged removed" ],
    "receipts": ["HubSpot workflow report", "engagement metrics"]
  },
  {
    "slug": "seo-content-overhaul",
    "title": "Organic traffic up 240% in 6 months with strategic content",
    "type": "Hybrid",
    "context": "B2B service company had minimal organic visibility for high-intent keywords.",
    "creative": "Conducted keyword research and competitive gap analysis, created 32 new SEO-optimized pages and blog posts, developed internal linking strategy.",
    "technical": "Implemented schema markup for services and FAQs, optimized Core Web Vitals, built XML sitemaps, set up Search Console tracking.",
    "results": [ "Organic traffic +240% in 6 months", "15 keywords ranking in top 3", "Organic-sourced leads +170%" ],
    "receipts": ["Search Console reports", "GA4 organic traffic graphs", "keyword ranking tracker"]
  },
  {
    "slug": "conversion-landing-page",
    "title": "Landing page CRO increases conversions from 2.1% to 8.7%",
    "type": "Hybrid",
    "context": "High-traffic landing page for paid campaigns had poor conversion rate.",
    "creative": "Rewrote headline to focus on core benefit, simplified form from 9 fields to 4, added trust badges and client logos, clarified CTA copy.",
    "technical": "Implemented heatmaps and session recordings via Hotjar, ran 3 rounds of A/B tests, improved page load speed by lazy-loading images.",
    "results": [ "Conversion rate from 2.1% to 8.7%", "Same traffic, 4x more leads", "Cost per lead reduced by 76%" ],
    "receipts": ["Hotjar heatmaps", "A/B test results", "before/after screenshots"]
  },
  {
    "slug": "marketing-automation-lifecycle",
    "title": "Automated lifecycle marketing increases LTV by 34%",
    "type": "Technical",
    "context": "E-commerce brand had transactional emails only, no nurture sequences.",
    "creative": "Mapped customer journey and created 7 automated campaigns: welcome series, educational content, cross-sell, post-purchase, review requests, loyalty program, win-back.",
    "technical": "Built workflows in Klaviyo with branching logic based on purchase behavior, integrated with Shopify for real-time data sync, set up cohort analysis tracking.",
    "results": [ "Email revenue contribution +$87k monthly", "Customer LTV +34%", "Repeat purchase rate from 12% to 23%" ],
    "receipts": ["Klaviyo workflow screenshots", "revenue attribution report"]
  },
  {
    "slug": "brand-messaging-refresh",
    "title": "Brand repositioning leads to 3x qualified demo requests",
    "type": "Creative",
    "context": "B2B SaaS struggled to differentiate from competitors, messaging was generic.",
    "creative": "Conducted customer interviews to identify unique value, developed new positioning framework, rewrote homepage and all core pages, created new brand voice guidelines.",
    "technical": "Updated site meta descriptions and title tags for SEO, implemented consistent messaging across all touchpoints, trained sales team on new messaging.",
    "results": [ "Demo requests +195% QoQ", "Sales qualified leads tripled", "Sales cycle shortened by 18 days" ],
    "receipts": ["Positioning doc", "before/after page screenshots", "CRM funnel metrics"]
  },
  {
    "slug": "webflow-site-rebuild",
    "title": "Migrated marketing site to Webflow, enabling team autonomy",
    "type": "Technical",
    "context": "Marketing team relied on dev team for every site update, causing bottlenecks.",
    "creative": "Designed component-based system with clear CMS structure for case studies and blog posts.",
    "technical": "Rebuilt entire site in Webflow with custom interactions, set up CMS collections, integrated with Zapier for form submissions, maintained 301 redirects for SEO.",
    "results": [ "Marketing team can now publish updates same-day", "Dev team freed up 15+ hours/month", "Site performance improved 40%" ],
    "receipts": ["Webflow project", "before/after Lighthouse scores"]
  },
  {
    "slug": "google-ads-lead-gen",
    "title": "Google Ads campaign generates 127 leads at $42 CPL",
    "type": "Hybrid",
    "context": "Professional services firm wanted to expand beyond referrals.",
    "creative": "Wrote search ads focused on specific pain points, created dedicated landing pages for each service, developed compelling offers (free consultation, guide downloads).",
    "technical": "Set up Google Ads with conversion tracking, implemented negative keyword strategy, created remarketing audiences, built automated bid rules.",
    "results": [ "127 qualified leads in 90 days", "$42 average CPL", "14 closed deals worth $86k" ],
    "receipts": ["Google Ads dashboard", "conversion tracking reports"]
  },
  {
    "slug": "attribution-modeling",
    "title": "Multi-touch attribution reveals hidden channel value",
    "type": "Technical",
    "context": "All credit went to last-click, causing underinvestment in awareness channels.",
    "creative": "Educated stakeholders on attribution models and presented data story showing full customer journey.",
    "technical": "Built custom attribution model in BigQuery pulling data from GA4, ad platforms, and CRM, created Looker Studio dashboard with channel contribution analysis.",
    "results": [ "Discovered social and content drove 40% of pipeline", "Budget reallocated to undervalued channels", "Overall CAC decreased 22%" ],
    "receipts": ["Attribution model SQL", "Looker dashboard", "budget allocation changes"]
  },
  {
    "slug": "product-launch-campaign",
    "title": "Coordinated product launch generates 1,200 signups in 2 weeks",
    "type": "Creative",
    "context": "New product feature needed awareness and adoption among existing user base.",
    "creative": "Developed launch strategy across email, in-app messaging, blog, and social media, created teaser campaign building anticipation, designed launch day assets.",
    "technical": "Set up product analytics to track feature adoption, coordinated email sequences in marketing automation, created in-app tooltips and modals.",
    "results": [ "1,200 signups in first 2 weeks", "45% of target audience activated feature within 30 days", "92% positive sentiment in user feedback" ],
    "receipts": ["Campaign timeline", "adoption metrics", "user feedback summary"]
  }
]
